"""
Подвиг 6.

На вход программе подается целое десятичное число.
Прочитайте его и, используя битовые операции, выполните целочисленное деление введенного числа на 2.
Выведите на экран полученное числовое значение.
"""

n = int(input())
print(n >> 1)
