"""
Подвиг 4. На вход программе подается строка с названиями городов, записанных в одну строчку через пробел.
Прочитайте эту строку и сформируйте на ее основе список из названий городов. Необходимо определить, что в этом
списке все города имеют длину более 5 символов. Если это так, то на экран вывести строку "ДА", иначе строку "НЕТ".
Программу реализовать с использованием цикла while и оператора break.
"""

# cities = input().split()

# i = 0
# res = True
# while i < len(cities):
#     if len(cities[i]) < 5:
#         res = False
#         break
#
#     i += 1
#
# msg = "ДА" if res is True else "НЕТ"
# print(msg)

# cities = "Самара Ульяновск Новгород Воронеж".split()
# cities = "Уфа Самара Ульяновск Новгород Воронеж Омск".split()
# cities = "Ульяновск Новгород Анапа Воронеж Омск".split()
# print(all([len(c) >= 5 for c in cities]))
