"""
Большой подвиг 1. Повторите быстрый алгоритм Евклида для нахождения наибольшего общего делителя двух натуральных чисел
a и b. В программе необходимо объявить функцию get_nod с двумя параметрами a и b (натуральные числа) и возвращающую
значение НОД(a, b).

P. S. Вызывать функцию не нужно, только задать. Постарайтесь реализовать алгоритм, не возвращаясь к материалу на видео.

Тесты: https://github.com/selfedu-rus/test-python-base/tree/main/7/7.3.1

Sample Input:

15 121050
Sample Output:

15

"""

# from math import gcd as get_nod

# def get_nod(a, b):
#     if a < b:
#         a, b = b, a
#
#     while b != 0:
#         a, b = b, a % b
#
#     return a
#
#

# get_nod(15, 30)
