"""
Подвиг 5.

На вход программе подается целое десятичное число.
Прочитайте его и, используя битовые операции, выполните умножение введенного числа на 4.
Выведите на экран полученное числовое значение.
"""

n = int(input())
print(n << 2)
