"""
Подвиг 4. На вход программе подается закодированная строка с помощью азбуки Морзе. Коды разделены между собой
пробелом. Необходимо ее раскодировать, используя азбуку Морзе из предыдущего занятия. Все буквы в строке должны быть
малыми (нижний регистр). Полученное сообщение (строку) вывести на экран.

P.S. Буквам е(ё) соответствует один и тот же код Морзе, поэтому всюду подставляется буква 'е'.

Тесты: https://github.com/selfedu-rus/test-python-base/tree/main/6/6.2.4

Sample Input:

.-- ... . -...- .-- . .-. -. ---
Sample Output:

все верно

"""

morze = {
    " ": "-...-",
    "А": ".-",
    "Б": "-...",
    "В": ".--",
    "Г": "--.",
    "Д": "-..",
    "Е": ".",
    "Ж": "...-",
    "З": "--..",
    "И": "..",
    "Й": ".---",
    "К": "-.-",
    "Л": ".-..",
    "М": "--",
    "Н": "-.",
    "О": "---",
    "П": ".--.",
    "Р": ".-.",
    "С": "...",
    "Т": "-",
    "У": "..-",
    "Ф": "..-.",
    "Х": "....",
    "Ц": "-.-.",
    "Ч": "---.",
    "Ш": "----",
    "Щ": "--.-",
    "Ъ": "--.--",
    "Ы": "-.--",
    "Ь": "-..-",
    "Э": "..-..",
    "Ю": "..--",
    "Я": ".-.-",
}

# rev_morze = {}
rev_morze = {
    v: k for k, v in morze.items()
}
# for k, v in morze.items():
#     rev_morze[v] = k

s = input()
# s = ".-- ... . -...- .-- . .-. -. ---"

o = [rev_morze[let] for let in s.split()]
for ol in o:
    print(ol.lower(), end='')
